In [2]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv('./PandasData.csv', delimiter=';', index_col=0)
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

In [7]:
index = df.index
columns = df.columns
values = df.values

In [9]:
index

Index(['Jane', 'Niko', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'], dtype='object')

In [11]:
columns

Index(['state', 'color', 'food', 'age', 'height', 'score'], dtype='object')

In [13]:
values

array([['NY', 'blue', 'Steak', 30, 165, 4.6],
       ['TX', 'green', 'Lamb', 2, 70, 8.3],
       ['FL', 'red', 'Mango', 12, 120, 9.0],
       ['AL', 'white', 'Apple', 4, 80, 3.3],
       ['AK', 'gray', 'Cheese', 32, 180, 1.8],
       ['TX', 'black', 'Melon', 33, 172, 9.5],
       ['TX', 'red', 'Beans', 69, 150, 2.2]], dtype=object)

In [15]:
type(index)

pandas.core.indexes.base.Index

In [17]:
type(columns)

pandas.core.indexes.base.Index

In [19]:
type(values)

numpy.ndarray

In [21]:
df['food']

Jane          Steak
Niko           Lamb
Aaron         Mango
Penelope      Apple
Dean         Cheese
Christina     Melon
Cornelia      Beans
Name: food, dtype: object

In [23]:
df[['color','food','score']]

           color    food  score
Jane        blue   Steak    4.6
Niko       green    Lamb    8.3
Aaron        red   Mango    9.0
Penelope   white   Apple    3.3
Dean        gray  Cheese    1.8
Christina  black   Melon    9.5
Cornelia     red   Beans    2.2

In [30]:
df.loc['Niko']

state        TX
color     green
food       Lamb
age           2
height       70
score       8.3
Name: Niko, dtype: object

In [31]:
df.loc[['Niko']]

     state  color  food  age  height  score
Niko    TX  green  Lamb    2      70    8.3

In [32]:
df.loc[['Niko','Jane']]

     state  color   food  age  height  score
Niko    TX  green   Lamb    2      70    8.3
Jane    NY   blue  Steak   30     165    4.6

In [45]:
df.loc['Niko':'Dean']

         state  color    food  age  height  score
Niko        TX  green    Lamb    2      70    8.3
Aaron       FL    red   Mango   12     120    9.0
Penelope    AL  white   Apple    4      80    3.3
Dean        AK   gray  Cheese   32     180    1.8

In [47]:
df.loc[:'Aaron']

      state  color   food  age  height  score
Jane     NY   blue  Steak   30     165    4.6
Niko     TX  green   Lamb    2      70    8.3
Aaron    FL    red  Mango   12     120    9.0

In [49]:
df.loc[::-1]

          state  color    food  age  height  score
Cornelia     TX    red   Beans   69     150    2.2
Christina    TX  black   Melon   33     172    9.5
Dean         AK   gray  Cheese   32     180    1.8
Penelope     AL  white   Apple    4      80    3.3
Aaron        FL    red   Mango   12     120    9.0
Niko         TX  green    Lamb    2      70    8.3
Jane         NY   blue   Steak   30     165    4.6

In [51]:
df.loc['Niko':'Christina':2]

          state  color   food  age  height  score
Niko         TX  green   Lamb    2      70    8.3
Penelope     AL  white  Apple    4      80    3.3
Christina    TX  black  Melon   33     172    9.5

In [53]:
df.loc['Dean':]

          state  color    food  age  height  score
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

In [55]:
df.loc[['Dean', 'Cornelia'], ['age', 'state', 'score']]

          age state  score
Dean       32    AK    1.8
Cornelia   69    TX    2.2

In [57]:
df.loc['Jane':'Penelope', ['state', 'color']]

         state  color
Jane        NY   blue
Niko        TX  green
Aaron       FL    red
Penelope    AL  white

In [59]:
df.loc['Jane', 'age']

30

In [61]:
df.loc[:'Dean', 'height':]

          height  score
Jane         165    4.6
Niko          70    8.3
Aaron        120    9.0
Penelope      80    3.3
Dean         180    1.8

In [63]:
df.loc[:, ['food', 'color']]

             food  color
Jane        Steak   blue
Niko         Lamb  green
Aaron       Mango    red
Penelope    Apple  white
Dean       Cheese   gray
Christina   Melon  black
Cornelia    Beans    red

In [65]:
df.loc[['Penelope','Cornelia'], :]

         state  color   food  age  height  score
Penelope    AL  white  Apple    4      80    3.3
Cornelia    TX    red  Beans   69     150    2.2

In [67]:
df.iloc[[2,3], [0, 4]]

         state  height
Aaron       FL     120
Penelope    AL      80

In [69]:
df.iloc[:3]

      state  color   food  age  height  score
Jane     NY   blue  Steak   30     165    4.6
Niko     TX  green   Lamb    2      70    8.3
Aaron    FL    red  Mango   12     120    9.0

In [71]:
df[:3]

      state  color   food  age  height  score
Jane     NY   blue  Steak   30     165    4.6
Niko     TX  green   Lamb    2      70    8.3
Aaron    FL    red  Mango   12     120    9.0

In [70]:
df[3:6]

          state  color    food  age  height  score
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5